In [62]:
import pandas as pd

In [63]:
dict_data = {'a' : 1, 'b' : 2, 'c' : 3}
series_data = pd.Series(dict_data)
series_data

a    1
b    2
c    3
dtype: int64

In [64]:
series_data.index

Index(['a', 'b', 'c'], dtype='object')

In [65]:
series_data.values

array([1, 2, 3], dtype=int64)

In [66]:
list_data = [4, -2, 6, 10, -34]
series_data = pd.Series(list_data)
series_data

0     4
1    -2
2     6
3    10
4   -34
dtype: int64

In [67]:
tu_data = ('sun', 'mon', 'tue', 'wed', 'thu', 'fri', 'sat')
series_data = pd.Series(tu_data)
series_data

0    sun
1    mon
2    tue
3    wed
4    thu
5    fri
6    sat
dtype: object

> ## 연습 2-1

In [68]:
animal = ['horse', 'monkey', 'mouse', 'tiger']
series_data = pd.Series(animal)
series_data

0     horse
1    monkey
2     mouse
3     tiger
dtype: object

In [69]:
list_data = ['홍길동', 20, 172.6, '대구시']
series_data = pd.Series(list_data, index=['이름', '나이', '키', '주소'])
series_data

이름      홍길동
나이       20
키     172.6
주소      대구시
dtype: object

In [70]:
series_data[['이름', '키']]

이름      홍길동
키     172.6
dtype: object

> ## 연습 2-2

In [71]:
student = ('계명문화대학교', '컴퓨터과', '이순신', '201111')
index = ['학교', '학과', '이름', '학번']
series_data = pd.Series(student, index)
series_data

학교    계명문화대학교
학과       컴퓨터과
이름        이순신
학번     201111
dtype: object

> ## 연습 2-3

In [72]:
print(series_data['학과'])
series_data[[3, 2]]

컴퓨터과

학번    201111
이름       이순신
dtype: object

In [73]:
series_data.name = '회원'
series_data.index.name = '제목' 
series_data

제목
학교    계명문화대학교
학과       컴퓨터과
이름        이순신
학번     201111
Name: 회원, dtype: object

> ## 연습 2-4

In [74]:
score = {'kor' : 90, 'math' : 80, 'eng' : 100}
series_data = pd.Series(score)
series_data.name = '점수'
series_data.index.name = '과목'
series_data

과목
kor      90
math     80
eng     100
Name: 점수, dtype: int64

> ## 연습 2-4-1

In [75]:
temperature = [-20, -10, 10, 20]
idx = ['Jan', 'Feb', 'Mar', 'Apr']
series_data = pd.Series(temperature, idx)
series_data

Jan   -20
Feb   -10
Mar    10
Apr    20
dtype: int64

In [76]:
series_data['Feb']

-10

In [77]:
series_data.name = '기온'
series_data.index.name = '월'
series_data

월
Jan   -20
Feb   -10
Mar    10
Apr    20
Name: 기온, dtype: int64

In [78]:
body = {'age' : [20, 30, 40],
       'height' : [165, 175, 185],
       'weight' : [55, 66, 77]}
index = ['베트맨', '슈퍼맨', '아이언맨']
df_body = pd.DataFrame(body, index)
df_body

      age  height  weight
베트맨    20     165      55
슈퍼맨    30     175      66
아이언맨   40     185      77

In [79]:
df_score = pd.DataFrame([[70, 80, 90],
                        [100, 60, 70],
                        [100, 70, 80],
                        [80, 90, 80]],
                       columns=['kor', 'math', 'eng'])
df_score

   kor  math  eng
0   70    80   90
1  100    60   70
2  100    70   80
3   80    90   80

In [80]:
df_score = pd.DataFrame([[70, 80, 90],
                        [100, 60, 70],
                        [100, 70, 80],
                        [80, 90, 80]],
                       columns=['kor', 'math', 'eng'], index = [1, 2, 3, 4])
df_score

   kor  math  eng
1   70    80   90
2  100    60   70
3  100    70   80
4   80    90   80

> ## 연습 2-5

In [81]:
df_people = pd.DataFrame([[18, '남', '성서고'],
                         [17, '여', '심인고'],
                         [16, '남', '호산고']],
                         columns = ['나이', '성별', '이름'], index = ['순신', '영희', '보고'])
df_people

    나이 성별   이름
순신  18  남  성서고
영희  17  여  심인고
보고  16  남  호산고

> ## 연습 2-6

In [82]:
dict_data = {'입고량' : [15, 25, 35, 45, 65],
            '판매량' : [5, 0, 7, 10, 50],
            '재고량' : [10, 25, 28, 35, 15]}
df_data = pd.DataFrame(dict_data, index = ['대구', '서울', '부산', '대전', '인천'])
df_data

    입고량  판매량  재고량
대구   15    5   10
서울   25    0   25
부산   35    7   28
대전   45   10   35
인천   65   50   15

In [83]:
df_score.index

Int64Index([1, 2, 3, 4], dtype='int64')

In [84]:
df_score.columns

Index(['kor', 'math', 'eng'], dtype='object')

In [85]:
df_score.index = ['park', 'lee', 'kim1', 'kim2']
df_score.columns = ['국어', '수학', '영어']
df_score

       국어  수학  영어
park   70  80  90
lee   100  60  70
kim1  100  70  80
kim2   80  90  80

> ## 연습 2-7

In [86]:
idx = ['Daegu', 'Seoul', 'Busan', 'Daejeon', 'Incheon']
col = ['input', 'output', 'remainder']
df_data.index = idx
df_data.columns = col
df_data

         input  output  remainder
Daegu       15       5         10
Seoul       25       0         25
Busan       35       7         28
Daejeon     45      10         35
Incheon     65      50         15

> ## 연습 2-7-1

In [87]:
print(df_people.index)
df_people.columns

Index(['순신', '영희', '보고'], dtype='object')

Index(['나이', '성별', '이름'], dtype='object')

In [88]:
df_score['sum'] = df_score['국어'] + df_score['수학'] + df_score['영어']
df_score['ave'] = df_score['sum'] / 3
df_score

       국어  수학  영어  sum        ave
park   70  80  90  240  80.000000
lee   100  60  70  230  76.666667
kim1  100  70  80  250  83.333333
kim2   80  90  80  250  83.333333

In [99]:
df_score.rename(columns = {'sum' : '합계', 'ave' : '평균'})
df_score

       국어  수학  영어   합계         평균
park   70  80  90  240  80.000000
lee   100  60  70  230  76.666667
kim1  100  70  80  250  83.333333
kim2   80  90  80  250  83.333333

In [101]:
df_score.rename(index = {'kim2' : 'gong'})
df_score

       국어  수학  영어   합계         평균
park   70  80  90  240  80.000000
lee   100  60  70  230  76.666667
kim1  100  70  80  250  83.333333
kim2   80  90  80  250  83.333333

> ## 연습 2-7-2

In [126]:
df_data.rename(index = {'Seoul' : 'SEOUL', 'Busan' : "BUSAN"}, columns = {'remainder' : 'Remainder'}, inplace = True)

In [104]:
df_score.drop('영어', axis = 1)

       국어  수학   합계         평균
park   70  80  240  80.000000
lee   100  60  230  76.666667
kim1  100  70  250  83.333333
kim2   80  90  250  83.333333

In [105]:
df_score.drop('kim1')

       국어  수학  영어   합계         평균
park   70  80  90  240  80.000000
lee   100  60  70  230  76.666667
kim2   80  90  80  250  83.333333

In [106]:
df_score.drop(['국어', '영어'], axis = 1)

      수학   합계         평균
park  80  240  80.000000
lee   60  230  76.666667
kim1  70  250  83.333333
kim2  90  250  83.333333

In [107]:
df_score.drop(['kim1', 'lee'])

      국어  수학  영어   합계         평균
park  70  80  90  240  80.000000
kim2  80  90  80  250  83.333333

> ## 연습 2-8

In [115]:
df_data.drop(['SEOUL', 'BUSAN'], inplace = True)
df_data.drop(['Remainder'], axis = 1)

         input  output
Daegu       15       5
Daejeon     45      10
Incheon     65      50

> ## 연습 2-8-1

In [116]:
data = {
    '이름' : ['표치수', '김대만', '송태섭', '서태웅', '강백호', '변덕규', '황태산', '윤대협'],
    '학교' : ['호산고', '호산고', '호산고', '호산고', '호산고', '성서고', '성서고', '성서고'],
    '키' : [197, 184, 168, 187, 188, 202, 188, 190],
    '국어' : [90, 40, 80, 40, 15, 80, 55, 100],
    '영어' : [85, 35, 75, 60, 20, 100, 65, 85],
    '수학' : [100, 50, 70, 70, 10, 95, 45, 90],
    '과학' : [95, 55, 80, 75, 35, 85, 40, 95],
    '사회' : [85, 25, 75, 80, 10, 80, 35, 95],
    'SW특기' : ['Python', 'Java', 'Javascript', '', '', 'C', 'PYTHON', 'C#']
}
dict_df = pd.DataFrame(data)

In [119]:
col = ['name', 'school','height','kor','eng','math','sci','soc','sw']
dict_df.columns = col

In [122]:
idx = ['1번','2번','3번','4번','5번','6번','7번','8번']
dict_df.index = idx
dict_df

   name school  height  kor  eng  math  sci  soc          sw
1번  표치수    호산고     197   90   85   100   95   85      Python
2번  김대만    호산고     184   40   35    50   55   25        Java
3번  송태섭    호산고     168   80   75    70   80   75  Javascript
4번  서태웅    호산고     187   40   60    70   75   80
5번  강백호    호산고     188   15   20    10   35   10
6번  변덕규    성서고     202   80  100    95   85   80           C
7번  황태산    성서고     188   55   65    45   40   35      PYTHON
8번  윤대협    성서고     190  100   85    90   95   95          C#

In [121]:
dict_df.rename(columns = {'kor' : 'KOR', 'eng' : 'ENG', 'math' : 'MATH'})

   name school  height  KOR  ENG  MATH  sci  soc          sw
1번  표치수    호산고     197   90   85   100   95   85      Python
2번  김대만    호산고     184   40   35    50   55   25        Java
3번  송태섭    호산고     168   80   75    70   80   75  Javascript
4번  서태웅    호산고     187   40   60    70   75   80
5번  강백호    호산고     188   15   20    10   35   10
6번  변덕규    성서고     202   80  100    95   85   80           C
7번  황태산    성서고     188   55   65    45   40   35      PYTHON
8번  윤대협    성서고     190  100   85    90   95   95          C#

In [123]:
dict_df.drop(['school', 'height'], axis = 1)

   name  kor  eng  math  sci  soc          sw
1번  표치수   90   85   100   95   85      Python
2번  김대만   40   35    50   55   25        Java
3번  송태섭   80   75    70   80   75  Javascript
4번  서태웅   40   60    70   75   80
5번  강백호   15   20    10   35   10
6번  변덕규   80  100    95   85   80           C
7번  황태산   55   65    45   40   35      PYTHON
8번  윤대협  100   85    90   95   95          C#

In [129]:
dict_df.rename(index = {'3번' : '33번', '8번' : '88번'})

    name school  height  kor  eng  math  sci  soc          sw
1번   표치수    호산고     197   90   85   100   95   85      Python
2번   김대만    호산고     184   40   35    50   55   25        Java
33번  송태섭    호산고     168   80   75    70   80   75  Javascript
4번   서태웅    호산고     187   40   60    70   75   80
5번   강백호    호산고     188   15   20    10   35   10
6번   변덕규    성서고     202   80  100    95   85   80           C
7번   황태산    성서고     188   55   65    45   40   35      PYTHON
88번  윤대협    성서고     190  100   85    90   95   95          C#

In [130]:
dict_df.drop(['4번'])

   name school  height  kor  eng  math  sci  soc          sw
1번  표치수    호산고     197   90   85   100   95   85      Python
2번  김대만    호산고     184   40   35    50   55   25        Java
3번  송태섭    호산고     168   80   75    70   80   75  Javascript
5번  강백호    호산고     188   15   20    10   35   10
6번  변덕규    성서고     202   80  100    95   85   80           C
7번  황태산    성서고     188   55   65    45   40   35      PYTHON
8번  윤대협    성서고     190  100   85    90   95   95          C#